<template>
  <div id="service" class="grid grid-cols-12 mt-16 md:mt-24">
    <div class="col-span-10 md:col-span-6">
      <h2>
        {{ data.title.text_before }}
        <span class="text-yellow-900">{{ data.title.text_span }}</span>
        {{ data.title.text_after }}
      </h2>
    </div>
    <div class="col-span-12 mt-6 grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 gap-3 overflow-visible">
      <div class="" v-for="(item, index) in data.items" :key="index">
        <ServeiceCard :data="item"/>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const data = reactive({
  title: {
    text_before: 'Повний спектр послуг зі',
    text_span: 'знищення',
    text_after: 'шкідників для кожного випадку'
  },
  subtitle: {
    text: 'Надаємо професійні послуги для квартир, будинків, офісів і промислових обʼєктів з гарантією безпеки та результату.'
  },
  items: [
    {
      title: 'Дезінсекція комах',
      text: 'Знищення шкідливих комах за допомогою електричних приладів, феромонних пасток, механічних засобів та професійних інсектицидів широкого спектру дії.',
      img: '/images/service_1.jpg',
      bg: 'bg-grey',
    },
    {
      title: 'Фумігація',
      text: 'Газова дезінсекція для складних випадків зараження великих приміщень та складів.',
      img: '/images/service_2.jpg'
    },
    {
      title: 'Фогація',
      text: 'Аерозольна обробка за допомогою генераторів гарячого та холодного туману для максимального проникнення засобу.',
      img: '/images/service_7.jpg'
    },
    {
      title: 'Дератизація гризунів',
      text: `Комплексні заходи з локалізації та знищення гризунів (щурів, мишей, полівок). Включає установку обладнання, регулярну заміну родентицидної принади, моніторинг пасток та утилізацію.`,
      img: '/images/service_4.jpg'
    },
    {
      title: 'Дезінфекція приміщень',
      text: 'Знищення шкідливих мікроорганізмів, грибка та плісняви з використанням професійних засобів.',
      img: '/images/service_5.jpg'
    },
    {
      title: 'Регулярне обслуговування',
      text: 'Постійний моніторинг та профілактика з частотою 4 рази на місяць за індивідуальним графіком.',
      img: '/images/service_8.jpg'
    },
    {
      title: 'Консультації та аналіз',
      text: 'Оцінка ризиків, визначення критичних точок контролю та розробка індивідуальних програм захисту від шкідників відповідно до міжнародних стандартів.',
      img: '/images/service_9.jpg'
    },
    {
      title: 'Залишите заявку на послугу',
      bg: 'bg-yellow',
      text: 'Ми пишаємося довготривалими відносинами з нашими клієнтами та пропонуємо вигідні умови співпраці для постійних партнерів. Обирайте професіоналів — обирайте надійність та якість.',
      link: {
        title: 'Залишити Заявку',
        url: '/#message'
      }
    },
  ]
})
</script>